# English constants
ones = {
    1: "one",
    2: "two",
    3: "three",
    4: "four",
    5: "five",
    6: "six",
    7: "seven",
    8: "eight",
    9: "nine",
}


teens = {
    10: "ten",
    11: "eleven",
    12: "twelve",
    13: "thirteen",
    14: "fourteen",
    15: "fifteen",
    16: "sixteen",
    17: "seventeen",
    18: "eighteen",
    19: "nineteen",
}

tens = {
    20: "twenty",
    30: "thirty",
    40: "forty",
    50: "fifty",
    60: "sixty",
    70: "seventy",
    80: "eighty",
    90: "ninety",
}

triplets_suffixes = {
    "en": {
        1: "",
        2: "thousand",
        3: "million",
        4: "billion",
        5: "trillion",
        6: "quadrillion",
        7: "quintillion",
        8: "sextillion",
    },
    "ar": {
        1: "",
        2: "ألف",
        3: "مليون",
        4: "مليار",
        5: "تريليون",
        6: "كوادريليون",
        7: "كوينتليون",
        8: "سكستليون",
    }
}

# Arabic constants
ones_ar = {
    1: "واحد",
    2: "اثنان",
    3: "ثلاثة",
    4: "أربعة",
    5: "خمسة",
    6: "ستة",
    7: "سبعة",
    8: "ثمانية",
    9: "تسعة",
}

teens_ar = {
    10: "عشرة",
    11: "أحد عشر",
    12: "اثنا عشر",
    13: "ثلاثة عشر",
    14: "أربعة عشر",
    15: "خمسة عشر",
    16: "ستة عشر",
    17: "سبعة عشر",
    18: "ثمانية عشر",
    19: "تسعة عشر",
}

tens_ar = {
    20: "عشرون",
    30: "ثلاثون",
    40: "أربعون",
    50: "خمسون",
    60: "ستون",
    70: "سبعون",
    80: "ثمانون",
    90: "تسعون",
}

hundreds_ar = {
    100: "مئة",
    200: "مئتان",
    300: "ثلاثمئة",
    400: "أربعمئة",
    500: "خمسمئة",
    600: "ستمئة",
    700: "سبعمئة",
    800: "ثمانمئة",
    900: "تسعمئة",
}

thousands_ar = {
    1_000: "ألف",
    2_000: "ألفان",
    3_000: "ثلاثة آلاف",
    4_000: "أربعة آلاف",
    5_000: "خمسة آلاف",
    6_000: "ستة آلاف",
    7_000: "سبعة آلاف",
    8_000: "ثمانية آلاف",
    9_000: "تسعة آلاف",
}
